In [21]:
# Load the pandas library
import pandas as pd

# Set the GitHub URL
url = 'https://raw.githubusercontent.com//mawalz05//PLSC381B_Analyzing_Politics_Python//main//Titanic.csv'

# Import the dataframe
df = pd.read_csv(url)

# View the first five obersvations of the dataframe
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [22]:
# Group rows by the values of the column 'Sex', calculate the mean of each group
df.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [23]:
# Grouping passengers by survived or not and then counting by name
df.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [24]:
# Grouping by multiple columns
df.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [26]:
# Print first two name uppercase using a for loop
for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [27]:
# print first two names uppercase using a list comprehension
[name.upper() for name in df['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

In [28]:
# Create a function that returns text uppercase
def uppercase(x):
    return x.upper()

In [29]:
# Using the function by itself
blue = "This house is blue"
uppercase(blue)

'THIS HOUSE IS BLUE'

In [30]:
# Apply function to show two rows
df['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [31]:
# Group by the variable sex and apply the count function to all other variables
df.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

In [32]:
# Concatenate two dataframes (combine them)

# Create DataFrame B
data_b = {'id': ['4', '5', '6'],
          'first': ['Billy', 'Brian', 'Bran'],
          'last': ['Bonder', 'Blacl', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])

# Create DataFrame A
data_a = {'id': ['1', '2', '3'],
         'first': ['Alex', 'Amy', 'Allen'],
         'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])

In [33]:
# Concatenate DataFrames by rows (stacking on top)
print(pd.concat([dataframe_a, dataframe_b], axis = 0))

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Blacl
2  6   Bran   Balwner

In [34]:
# Concatenate DataFrames by columns (placing side by side)
print(pd.concat([dataframe_a, dataframe_b], axis = 1))

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Blacl
2  3  Allen       Ali  6   Bran  Balwner

In [35]:
# Use append to add new row to a Dataframe
row = pd.Series([10, 'Chris', 'Chillion'], index = ['id', 'first', 'last'])
print(dataframe_a.append(row, ignore_index = True))

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris  Chillion

In [36]:
# Merging two Dataframes

# Creating DataFrames
employee_data = {'employee_id': ['1','2','3','4'],
                'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id', 'name'])

sales_data = {'employee_id': ['3','4','5','6'],
              'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id', 'total_sales'])

In [37]:
# Merge Data Frames (inner join)
print(pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id'))

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [38]:
# Merge Data Frames (outer join)
print(pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id', how = 'outer'))

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [40]:
# Merge Data Frames (left/right join)
print(pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id', how = 'right'))

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512
2           5         NaN         2345
3           6         NaN         1455

In [41]:
# Merge Data Frames that have different column names
dataframe_employees.rename(columns = {'employee_id': 'employee'}, inplace = True)

pd.merge(dataframe_employees, dataframe_sales, left_on = 'employee', right_on = 'employee_id')

  employee        name employee_id  total_sales
0        3  Alice Bees           3        23456
1        4  Tim Horton           4         2512